// Array of Object
const quiz =[
    {
        q:"តើ​ពាក្យ​មួយណា​ដែល​ពិពណ៌នា​អំពី​រចនាសម្ព័ន្ធ​នៃ​អាណាចក្រ​ខ្មែរ​បាន​ត្រឹមត្រូវ​បំផុត?",
        Options:[' ឋានានុក្រម','គ្មានរចនាសម្ព័ន្ធ','អាចបត់បែនបាន','ទាំងអស់'],
        answer:0
    },
    {
        q:"តើស្ដេចខ្មែរអង្គណារចនាប្រាសាទអង្គរវត្ត?",
        Options:['យសោវរ្ម័នទី ១','សូរ្យវរ្ម័នទី ២ ','ព្រះបាទជ័យវរ្ម័នទី​ ៧','ព្រះបាទជ័យវរ្ម័ន ៥'],
        answer:2
    },
    {
        q:"តើអាណាចក្រខ្មែរត្រូវបានបង្កើតឡើងនៅពេលណា?",
        Options:['៩១០','៨១០','៧០២','៨០២'],
        answer:3
    },
    {
        q:"នៅឆ្នាំ ១៤៣១ អាណាចក្រខ្មែរបានចុះចាញ់នឹងការឈ្លានពានរបស់ជាតិណា?",
        Options:['ចិន','ជប៉ុន','ចាម','សៀម'],
        answer:3
    },
    {
        q:"តើអាណាចក្រខ្មែរត្រូវបានបង្កើតឡើងនៅពេលណា?",
        Options:['៩១០','៨១០','៧០២','៨០២'],
        answer:3
    },
    {
        q:"សាសនាធំៗ២ក្នុងអាណាចក្រខ្មែរគឺ?",
        Options:['ពុទ្ធសាសនា និងព្រហ្មញ្ញសាសនា ','ពុទ្ធសាសនា និងគ្រិស្តសាសនា','ព្រហ្មញ្ញសាសនា និងពុទ្ធសាសនា','សាសនាឥស្លាម និងពុទ្ធសាសនា'],
        answer:0
    },
    {
        q:"តើបារាយណ៍ជាអ្វី?",
        Options:['អាងស្តុកទឹកដែលផ្ទុកទឹករាប់លានម៉ែត្រគូប','ទាសករស្រី','បុរាណបំផុតនៃសាសនាពិភពលោកសំខាន់ៗទាំងអស់មកពីប្រទេសឥណ្ឌា','ផ្នូរដ៏ធំ ផ្នូរដ៏ធំ'],
        answer:1
    },
    {
        q:"តើទន្លេធំដែលហូរកាត់តំបន់អង្គរមានឈ្មោះអ្វី?",
        Options:['A.មេឡុង','B.មេហ្គុង','C.មេសុងC','D.មេគង្គ'],
        answer:3
    },
    {
        q:"តើអាណាចក្រខ្មែរបញ្ចប់នៅពេលណា?",
        Options:['ក. ១៤៣១ ','ខ.','គ. ១៦៥៣','ឃ. ៩០២'],
        answer:1
    },
    {
        q:"អាណាចក្រខ្មែរមានរយៈពេលយូរជាងចក្រភពរ៉ូម?",
            Options:['ក. ត្រូវ -','ខ. ខុស',],
        answer:1
    },
    {
        q:"អាណាចក្រខ្មែរដ៏អស្ចារ្យបំផុតគឺខ្មែរត្រូវបានបង្កើតឡើងនសតវត្សទី៩នៃគ.ស ក្រោមស្តេចដ៏អស្ចារ្យមួយណា?",
        Options:['ក. សូរ្យវរ្ម័ន','ខ. ឥន្ទ្រវរ្ម័ន','គ. ព្រះបាទជ័យវរ្ម័នទី៧','ឃ. ព្រះបាទជ័យវរ្ម័នទី២'],
        answer:3
    },
    {
        q:"ជនជាតិណាដែលនាំអាណាចក្រមកលុតជង្គង់ដោយឈ្លានពានរាជធានីក្នុងឆ្នាំ ១៣៥៣?",
        Options:['ប្រទេសថៃ','ប្រទេសវៀតណាម','ភូមា','ចាវ៉ា'],
        answer:0
    },
    {
        q:"នៅឆ្នាំ១៨៦៣ ប្រទេសណាបង្កើតអាណាព្យាបាលលើប្រទេសកម្ពុជា?",
        Options:['ប្រទេសបារាំង','ហូឡង់','ប្រទេសអង់គ្លេស','ព័រទុយហ្គាល'],
        answer:0
    },
    {
        q:"តើនរណាជាព្រះមហាក្សត្រចុងក្រោយនៃប្រទេសកម្ពុជាសេរី មុនសម័យអាណានិគម?",
        Options:['ព្រះបាទនរោត្តម','ព្រះបាទរាជា','ព្រះបាទសីហនុ','ព្រះបាទ រណឫទ្ធិ'],
        answer:0
    },
    {
        q:"ភាគច្រើននៃប្រវត្តិសាស្ត្រនៃអាណាចក្រខ្មែរត្រូវបានបន្សល់ទុកជាប្រពៃណីផ្ទាល់មាត់។ អ្វី​ដែល​ត្រូវ​បាន​សរសេរ​ត្រូវ​បាន​ធ្វើ​នៅ​ក្នុង​សិលាចារឹក​និង​ការ​ឆ្លាក់។ តើ​សិលាចារឹក​ទាំង​នេះ​ត្រូវ​បាន​គេ​ធ្វើ​ជា​ភាសា​អ្វី ដែល​ជា​ភាសា​ខ្មែរ??",
        Options:['សំស្ក្រឹត','ហិណ្ឌូ','កុកងឺ','តៃ'],
        answer:0
    },
    {
        q:" ខ្មែរសម័យដើម ឥទ្ធិពលពី វិជ្ជាទេវរាជ ហិណ្ឌូ ជាពិសេសគឺ ព្រះបាទជ័យវរ្ម័នទី១។ ភ្ញាក់ផ្អើលជាខ្លាំងនៅក្នុង pantheon ហិណ្ឌូ?",
        Options:['ស្តេច','កំពូលភ្នំ','សម្ដេចសង្ឃ','ស្វាប្រាសាទ'],
        answer:0
    },
    {
        q:"ព្រះបាទជ័យវរ្ម័នទី២ ត្រូវបានគេចាត់ទុកថា ជាស្ថាបនិកនៃអាណាចក្រខ្មែរ។ នៅ​ក្នុង​សិលាចារឹក​គេ​និយាយ​ថា​ទ្រង់​បាន​បំបែក​អាណាចក្រ​មួយ​ចេញពី​មួយទៀត ។ ប្រហែល​ជា​ផ្អែក​លើ​កោះ​ឥណ្ឌូណេស៊ី តើ​ព្រះបាទ​ជ័យវរ្ម័ន​ទី​២​បាន​បំបែក​អាណាចក្រ​របស់​ព្រះអង្គ​ពី​ណា?",
        Options:['ភូមា','ចំប៉ា','សេលីនដ្រា','ចាវ៉ា'],
        answer:3
    },
    {
        q:"យុគសម័យមាសនៃអាណាចក្រខ្មែរមានទំនាក់ទំនងជាមួយរាជធានីដ៏ធំនៅខាងជើងទន្លេសាប?",
        Options:['បន្ទាយស្រី','ករុណា','ភ្នំពេញ','អង្គរ'],
        answer:3
    },
    {
        q:"បន្ទាប់ពីការសោយទីវង្គតរបស់ព្រះបាទនរោត្តម នៅឆ្នាំ១៩០៤ ដែលព្រះមហាក្សត្រខ្មែរបានឡើងសោយរាជ្យបន្តបល្ល័ង្ក??",
        Options:['ស៊ីសុវត្ថិ','ព្រះសីហនុ','មុនីវង្ស','សុវណ្ណខេត'],
        answer:0
    },
    {
        q:"ប៉ុល ពត គឺជាមេដឹកនាំដំបូងរបស់កុម្មុយនិស្តកម្ពុជា។ តើឈ្មោះពិតរបស់គាត់ជាអ្វី?",
        Options:['សាឡុត ស','អៀង សារី','សឺន សែន','អង្គចាន់'],
        answer:0
    }
];
